import {
  PageHeader,
  Quote,
  Stats,
  Testimonials,
} from '@/components/sections/shared';
import { Metadata } from 'next';
import { Header, Footer } from '@/components/layout';

export const metadata: Metadata = {
  title: 'ადგილობრივი მომხმარებლები',
  description: '',
};

export default function CustomersPage() {
  return (
    <>
      <Header />
      <PageHeader
        title="ადგილობრივი მომხმარებლები"
        description="თბილისი მედიკში ვაერთიანებთ მომხმარებლებს, რომლებიც გვირჩევენ ნდობას, ხარისხსა და გრძელვადიან ურთიერთობას და ჩვენთან ერთად ქმნიან თანამედროვე, ადამიანზე ორიენტირებულ სამედიცინო გამოცდილებას."
      />
      <Quote
        title="მომხმარებლებს"
        text={[
          'ჩვენი მომხმარებლები არიან ადამიანები, რომლებმაც აირჩიეს საიმედო და პასუხისმგებლიანი დამოკიდებულება საკუთარი ბიზნესებისა და ძვრიფასი პაციენტების ჯანმრთელობის მიმართ. ეს არის არჩევანი, რომელიც ყოველდღიურად გვავალდებულებს, თითოეულ დეტალში დავიცვათ მაღალი სტანდარტი - მომსახურებაში, კომუნიკაციაში და შედეგებში.',
          'გულწრფელად მადლობლები ვართ თქვენი ნდობის - იმ გზისთვის, რომელსაც ჩვენთან ერთად გადიხართ, და იმ ურთიერთობისთვის, რომელიც დროთა განმავლობაში გრძელვადიან პარტნიორობად ყალიბდება.',
          'წარსულში, თქვენგან მიღებული უკუკავშირები, მოლოდინები და გამოცდილება არის ის საფუძველი, რომელის მიხედვითაც ვაყალიბებთ თბილისი მედიკის ორგანიზაციულ ხედვებსა და მისიას.',
        ]}
        authorName="დავით ჯიშკარიანი"
        authorRole="მარტკეტინგის ხელმძღვანელი"
        image="/images/categories/1.jpg"
      />
      <Stats
        title="მომხმარებლები რიცხვებში"
        stats={[
          {
            id: 1,
            value: '350',
            label: 'მომხმარებელი',
            image: '/images/categories/1.jpg',
          },
          {
            id: 2,
            value: '92%',
            label: 'შენარჩუნების ინდექსი',
            image: '/images/categories/2.jpg',
          },
          {
            id: 3,
            value: '95%',
            label: 'NPS ინდექსი',
            image: '/images/categories/3.jpg',
          },
        ]}
      />
      <Testimonials />
      <Footer />
    </>
  );
}
