import { Metadata } from 'next';
import {
  PageHeader,
  Quote,
  Stats,
  Stories,
} from '@/components/sections/shared';

export const metadata: Metadata = {
  title: 'თანამშრომლები ',
  description: '',
};

const employeeStories = [
  {
    id: 1,
    title: 'ელენე ბუაჩიძე | მთავარი იურისტი',
    description:
      'გაიგეთ მეტი თბილისი მედიკის მთავარი იურისტის, ელენე ბუაჩიძის მედიკური მოგზაურობის შესახებ.',
    image: '/images/categories/1.jpg',
    href: '/',
  },
  {
    id: 2,
    title: 'დავით ჯიშკარიანი | მარკეტინგის გუნდის ხელმძღვანელი',
    description:
      'გაიგეთ მეტი თბილისი მედიკის მარკეტინგის ხელმძღვანელის, დავით ჯიშკარიანის მედიკური მოგზაურობის შესახებ.',
    image: '/images/categories/2.jpg',
    href: '/',
  },
  {
    id: 3,
    title: 'გოგა მაზიაშვილი | საოპერაციო დირექტორი',
    description:
      'გაიგეთ მეტი თბილისი მედიკის საოპერაციო დირექტორის, გოგა მაზიაშვილის მედიკური მოგზაურობის შესახებ.',
    image: '/images/categories/3.jpg',
    href: '/',
  },
];

export default function EmployeesPage() {
  return (
    <>
      <PageHeader
        title="თანამშრომლები"
        description="თბილისი მედიკში ვაერთიანებთ ბაზრისთვის უპრეცედენტო რაოდენობის პროფესიონალებს, რომლებიც სხვადასხვა კარიერული გზით შემოგვიერთდნენ და ჩვენთან სრულფასოვან „მედიკელებად“ ჩამოყალიბდნენ."
      />
      <Quote
        title="მედიკელებს"
        text={[
          'მედიკელები ჩემთვის არიან ადამიანები, რომლებმაც აირჩიეს პასუხისმგებლობა, ერთგულება და ხარისხი ყოველდღიურ საქმიანობაში. ეს არის არჩევანი, რომელიც თითოეულ თქვენგანში ყოველდღიურად ჩანს - თქვენს დამოკიდებულებაში ჯანდაცვის სპეციალისტების, კოლეგებისა და საკუთარი პროფესიის მიმართ. მე გულწრფელად ვამაყობ თითოეული მედიკელით - იმ გზით, რომელსაც თქვენს გადიხართ და იმ სტანდარტით, რომელსაც დღეს ერთად ვქმნით.',
          'მადლობა თქვენი შრომის, პროფესიონალიზმისა და იმ ადამიანურობისთვის, რომელიც საფუძველია თბილისი მედიკის საქმიანობისთვის. სწორედ თქვენ ქმნით იმ ნდობასა და ღირებულებას, რის გამოც ჩვენი კომპანია დღეს არა უბრალოდ სამედიცინო დანესებულება, არამედ ხიდია საერთშორისო გამოცდილებასა და ქართულ მედიცინას შორის.',
        ]}
        authorName="ლევან ხომერიკი"
        authorRole="გენერალური დირექტორი"
        image="/images/categories/1.jpg"
      />
      <Stats
        title="თანამშრომლები რიცხვებში"
        stats={[
          {
            id: 1,
            value: '85',
            label: 'თანამშრომელი',
            image: '/images/categories/1.jpg',
          },
          {
            id: 2,
            value: '15',
            label: 'დამოუკიდებელი გუნდი',
            image: '/images/categories/2.jpg',
          },
          {
            id: 3,
            value: '92%',
            label: 'ENPS ინდექსი',
            image: '/images/categories/3.jpg',
          },
        ]}
      />
      <Stories
        title="ადამიანების დღიურები"
        description="გაიგეთ ადამიანების ყოველდღიურობაზე, პროფესიულ გზაზე და პირად გამოცდილებაზე. ამ სტატიების საშუალებით მკითხველი გაეცნობა ადამიანებს კომპანიის მიღმა, მათ ხედვებს, გამოწვევებსა და მოტივაციას, რაც ქმნის უფრო ახლო, ავთენტურ და ადამიანურ სურათს ორგანიზაციის შიდა კულტურის შესახებ."
        stories={employeeStories}
      />
    </>
  );
}
