import { Metadata } from 'next';
import { PageHeader, Quote, Stats } from '@/components/sections/shared';

export const metadata: Metadata = {
  title: 'თანამშრომლები ',
  description: '',
};

export default function EmployeesPage() {
  return (
    <>
      <PageHeader
        title="თანამშრომლები"
        description="თბილისი მედიკში ვაერთიანებთ ბაზრისთვის უპრეცედენტო რაოდენობის პროფესიონალებს, რომლებიც სხვადასხვა კარიერული გზით შემოგვიერთდნენ და ჩვენთან სრულფასოვან „მედიკელებად“ ჩამოყალიბდნენ."
      />
      <Quote
        title="მედიკელებს"
        text={[
          'მედიკელები ჩემთვის არიან ადამიანები, რომლებმაც აირჩიეს პასუხისმგებლობა, ერთგულება და ხარისხი ყოველდღიურ საქმიანობაში. ეს არის არჩევანი, რომელიც თითოეულ თქვენგანში ყოველდღიურად ჩანს - თქვენს დამოკიდებულებაში ჯანდაცვის სპეციალისტების, კოლეგებისა და საკუთარი პროფესიის მიმართ. მე გულწრფელად ვამაყობ თითოეული მედიკელით - იმ გზით, რომელსაც თქვენს გადიხართ და იმ სტანდარტით, რომელსაც დღეს ერთად ვქმნით.',
          'მადლობა თქვენი შრომის, პროფესიონალიზმისა და იმ ადამიანურობისთვის, რომელიც საფუძველია თბილისი მედიკის საქმიანობისთვის. სწორედ თქვენ ქმნით იმ ნდობასა და ღირებულებას, რის გამოც ჩვენი კომპანია დღეს არა უბრალოდ სამედიცინო დანესებულება, არამედ ხიდია საერთშორისო გამოცდილებასა და ქართულ მედიცინას შორის.',
        ]}
        authorName="ლევან ხომერიკი"
        authorRole="გენერალური დირექტორი"
        image="/images/categories/1.jpg"
      />
      <Stats
        title="თანამშრომლები რიცხვებში"
        stats={[
          {
            id: 1,
            value: '85',
            label: 'თანამშრომელი',
            image: '/images/categories/1.jpg',
          },
          {
            id: 2,
            value: '15',
            label: 'დამოუკიდებელი გუნდი',
            image: '/images/categories/2.jpg',
          },
          {
            id: 3,
            value: '92%',
            label: 'ENPS ინდექსი',
            image: '/images/categories/3.jpg',
          },
        ]}
      />
    </>
  );
}
