import { PageHeader, Quote, Stats } from '@/components/sections/shared';
import { Metadata } from 'next';

export const metadata: Metadata = {
  title: 'საერთაშორისო პარტნიორები',
  description: '',
};

export default function PartnersPage() {
  return (
    <>
      <PageHeader
        title="საერთაშორისო პარტნიორები"
        description="თბილისი მედიკში ვაერთიანებთ საერთაშორისო პარტნიორებს, რომლებიც წამყვანი სამედიცინო ქვეყნიდან შემოგვიერთდნენ და ჩვენთან ერთად ქმნიან მზარდ ადგილობრივ სამედიცინო ეკოსისტემას."
      />
      <Quote
        title="პარტნიორებს"
        text={[
          'ჩვენი საერთაშორისო პარტნიორები ჩემთვის არიან პროფესიონალები, რომლებმაც აირჩიეს ხარისხი, პასუხისმგებლობა და გრძელვადიანი თანამშრომლობა ყოველდღიურ საქმიანობაში. ეს არის არჩევანი, რომელიც ნათლად ჩანს ჩვენს საერთო პროექტებში, სტანდარტებში და იმ ნდობაში, რომელსაც ერთმანეთის მიმართ ვაშენებთ.',
          'გულწრფელად ვაფასებ თითოეულ პარტნიორს - იმ გამოცდილებას და ღირებულებას, რომელსაც ერთად ვქმნით თბილისი მედიკისთვის და მთლიანად ჯანდაცვის სფეროსთვის.',
          'მადლობას გიხდით პარტნიორობისთვის, რომელიც  სცდება ერთჯერად პროექტებს და გარდაიქმნება მდგრად ურთიერთობად. სწორედ თქვენ ხართ ის ხიდი, რომელიც საერთაშორისო ინოვაციას, საუკეთესო პრაქტიკასა და ხარისხს ქართულ მედიცინასთან აკავშირებს.',
        ]}
        authorName="გიორგი მეზვრიშვილი"
        authorRole="პროდუქციის დირექტორი"
        image="/images/categories/1.jpg"
      />
      <Stats
        title="პარტნიორები რიცხვებში"
        stats={[
          {
            id: 1,
            value: '200',
            label: 'პარტნიორი',
            image: '/images/categories/1.jpg',
          },
          {
            id: 2,
            value: '30',
            label: 'მიმართულება',
            image: '/images/categories/2.jpg',
          },
          {
            id: 3,
            value: '5000',
            label: 'პროდუქტი',
            image: '/images/categories/3.jpg',
          },
        ]}
      />
    </>
  );
}
